{"posts":[{"title":"Day1","text":"The simple present and the present continuous The simple present is used to talk about facts more or less permanent and regular actions or events. The present continuous is used to describe an action actually taking place at the moment when one is speaking. Example: Simple present She works every day from 9 a.m. to 6 p.m. Present continuous I’m working on the computer right now. ‘Would like’: expressing wishes The conditional ‘would like’ may express a wish or desire. ‘Would like‘ is contracted ‘-‘d like.’ ‘Would like‘ precedes an infinitive or a noun or noun phrase. Example: I’d like to go to the movies. I would like more details. Used as an interrogative, ‘would like’ is a more polite synonym of ‘(do) want.’ Example: What kind of gas would you like? Would you like to have a drink? Would you like to see the backyard? The use and omission of theThe article the is used before plural nouns or uncountable nouns when the noun is determined, its meaning is defined by the context. Example: The cities in Europe are all very different. The coffee you gave me is really good. The is not used: in generalizations with plural nouns or uncountable nouns. Example: I don’t like towns. (plural noun) I prefer tea to coffee. (uncountable) The is not used: before a plural or an uncountable noun with the meaning ‘a certain amount of.’ Example: I have to buy butter and jelly. (uncountable) There are cities I don’t like. (plural noun) The is not used: before names of meals when they have a general sense. Example: The breakfast I had yesterday was very good. (particular sense) Breakfast is ready. (general sense) when the noun is determined, its meaning is defined by the context. Example: The cities in Europe are all very different. The coffee you gave me is really good. The is not used: in generalizations with plural nouns or uncountable nouns. Example: I don’t like towns. (plural noun) I prefer tea to coffee. (uncountable) The is not used: ·before a plural or an uncountable noun with the meaning ‘a certain amount of.’ Example: I have to buy butter and jelly. (uncountable) There are cities I don’t like. (plural noun) The is not used: ·before names of meals when they have a general sense. Example: The breakfast I had yesterday was very good. (particular sense) Breakfast is ready. (general sense) ‘Little’ - ‘A little’ - ‘Much’The indefinite adjectives (or pronouns) little, a little and much express a notion of quantity and are used before an uncountable singular noun. little is used to stress a very small quantity. a little is used when describing a small quantity, but contrary to little, it is only a simple statement. much is used when describing a large quantity. Example:There is very little juice left.There is a little juice in the fridge, if you want.We have much work to do today. There isn’t much coffee left. Note.Often, in the affirmative form, much is replaced by a lot of or plenty of. Example: There’s a lot of tea in China. When the noun is understood, the indefinite adjectives become indefinite pronouns. Example: There is little (juice) left. ‘Too’ - ‘Too much’ ‘Too’ precedes adjectives and adverbs. ‘Too much’ precedes uncountable (singular) nouns; ‘too many’ precedes plural countable nouns. Example: My tea’s too strong. He runs too fast. Too much sun is bad for you. She has too many friends. Note. When ‘too much’ modifies a verb, it follows the verb. Example: He drank too much. ‘Some’ - ‘Any’ The article ‘some’ precedes a countable plural or uncountable noun or nounphrase and indicates an undetermined quantity. Example: Could you give me some informationon your villas?Some children were playing outside. ·The pronoun ‘some’ replaces a countable plural or uncountable noun or noun phrase. Example: If you like milk, I have some.Where are the sponges? We have to buy some. The article or the pronoun ‘any’ replaces the article or the pronoun ‘some’ in an interrogative or negative clause. Example: Do you have any children?No,we don’t have any.Any may also be used to express total permission, possibility, or restriction. Permission and Restriction Example: Feel free to ask questions at any time during the presentation. Employees may not leave the premises under any circumstances.You cannot open these files at any time.·Possibility or Indifference Example: Any of these designs would work well. You can choose any topic you think is pertinent for your presentation. We could meet any place that’s convenient to discuss the project.","link":"/2020/01/21/rosetta-notes/%E8%AF%AD%E6%B3%95/"},{"title":"Hexo GITHUB page","text":"","link":"/2021/01/22/%E5%8D%9A%E5%AE%A2/hexo%20github%20page/"},{"title":"Hexo 搭建","text":"玩了这么多年博客，也要记录搭建的心路。重新整理HEXO的一套方法。 环境搭建hexo需要依赖nodejs环境，关于搭建nodejs的环境最佳建议还是使用NVM。 简单来说，nodejs是运行环境，hexo是运行所需的依赖，对于这个博客而言就是起到渲染的作用。 本地的话，还是建议全局安装, 当然也可以安装到项目中，方便迁移。 12npm install -g hexo-cli # 全局npm install hexo #项目 安装好之后就可以使用hexo命令进行操作了，这个是一个hexo附带的模板。 Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment 主题美化当然，初始的界面还很丑，还需要我们去找一些主题。我现在用的是icarus，目前有5.7K的star，配置上比以前配置hexo简直方便太多。以前用过hexo，无奈太火了导致烂大街，不然小清新十分好看。Indigo这个主题和写字楼同名，不确定是不是楼里大佬所写。最终还是选了icarus的简单配置，上了年纪，已经不像年轻人一般追求热火，力求轻量。用最少的配置来写文章，用最轻的电脑来办公，用核心显卡来代替独立显卡。 hexo的配置文件是_config.yml，其中加了注释的是覆盖主题配置文件的。 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364title: Hexosubtitle: ''description: ''keywords: nullauthor: Xu # 作者姓名language: zh-CN # 语言timezone: ''url: http://mengze-han.github.io # URLpermalink: ':year/:month/:day/:title/'permalink_defaults: nullpretty_urls: trailing_index: true trailing_html: truesource_dir: sourcepublic_dir: publictag_dir: tagsarchive_dir: archivescategory_dir: categoriescode_dir: downloads/codei18n_dir: ':lang'skip_render: nullnew_post_name: ':title.md'default_layout: posttitlecase: falseexternal_link: enable: true field: site exclude: ''filename_case: 0render_drafts: falsepost_asset_folder: falserelative_link: falsefuture: truehighlight: enable: true line_number: true auto_detect: false tab_replace: '' wrap: true hljs: falseprismjs: enable: false preprocess: true line_number: true tab_replace: ''index_generator: path: '' per_page: 10 order_by: '-date'default_category: uncategorizedcategory_map: nulltag_map: nullmeta_generator: truedate_format: YYYY-MM-DDtime_format: HH:mm:ssupdated_option: mtimeper_page: 10pagination_dir: pageinclude: nullexclude: nullignore: nulltheme: icarusdeploy: type: '' 接下来是_config.icarus.yml，这个是icarus主题的配置文件： 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191192193194195196197198199200201202203204205206207208209210211212213214215216217218219version: 5.1.0variant: defaultlogo: text: 镜湖元自属闲人head: favicon: /img/favicon.svg manifest: name: short_name: start_url: theme_color: background_color: display: standalone icons: - src: '' sizes: '' type: open_graph: title: type: blog url: image: site_name: author: description: twitter_card: twitter_id: twitter_site: google_plus: fb_admins: fb_app_id: structured_data: title: description: url: author: publisher: publisher_logo: image: meta: - '' rss: navbar: menu: # 下边需要改成中文 主页: / 时光线: /archives 分类: /categories 标签: /tags 技术: /vue_blog AWS: /aws 关于我: /about # Home: / # Archives: /archives # Categories: /categories # Tags: /tags # Tech: /tech # Aws: /aws # About: /about links: Download on GitHub: icon: fab fa-github url: https://github.com/mengze-hanfooter: links: Creative Commons: icon: fab fa-creative-commons url: https://creativecommons.org/ Attribution 4.0 International: icon: fab fa-creative-commons-by url: https://creativecommons.org/licenses/by/4.0/ Download on GitHub: icon: fab fa-github url: https://github.com/mengze-hanarticle: highlight: theme: atom-one-light clipboard: true fold: unfolded readtime: true update_time: true licenses: Creative Commons: icon: fab fa-creative-commons url: https://creativecommons.org/ Attribution: icon: fab fa-creative-commons-by url: https://creativecommons.org/licenses/by/4.0/ Noncommercial: icon: fab fa-creative-commons-nc url: https://creativecommons.org/licenses/by-nc/4.0/search: type: insight index_pages: truecomment: type: disqus shortname: 'my'donates: - type: afdian url: '' - type: alipay qrcode: '' - type: patreon url: '' - type: wechat qrcode: ''# share:# type: sharethis# install_url: ''sidebar: left: sticky: false right: sticky: truewidgets: - position: left type: profile author: Xu author_title: AWS SUPPORT location: Bei Jing avatar: avatar_rounded: false gravatar: follow_link: https://github.com/mengze-han social_links: Github: icon: fab fa-github url: https://github.com/mengze-han Facebook: icon: fab fa-facebook url: https://facebook.com Twitter: icon: fab fa-twitter url: https://twitter.com Dribbble: icon: fab fa-dribbble url: https://dribbble.com RSS: icon: fas fa-rss url: / - position: left type: toc index: true collapsed: true depth: 3 - position: left type: links links: Hexo: https://hexo.io Bulma: https://bulma.io - position: left type: categories - position: right type: recent_posts - position: right type: archives - position: right type: tags order_by: name amount: show_count: true - position: right type: subscribe_email description: feedburner_id: '' - position: left type: followit description: action_url: '' verification_code: ''plugins: animejs: true back_to_top: true baidu_analytics: tracking_id: bing_webmaster: tracking_id: busuanzi: false cnzz: id: web_id: cookie_consent: type: info theme: edgeless static: false position: bottom-left policyLink: https://www.cookiesandyou.com/ gallery: true google_analytics: tracking_id: hotjar: site_id: katex: false mathjax: false outdated_browser: false progressbar: true statcounter: project: security: twitter_conversion_tracking: pixel_id: providers: cdn: jsdelivr fontcdn: google iconcdn: fontawesome","link":"/2021/01/22/%E5%8D%9A%E5%AE%A2/hexo%E6%90%AD%E5%BB%BA/"},{"title":"Hexo 注意","text":"文章类型source 目录是放置文稿的地方，其中有几个保留的名称，也就是hexo的三种布局post、page 和 draft，其中post是需要发布的文章，draft是草稿，文章分别存放在_post, _draft的目录下,page是单独的文件夹，名字随意，类似于路由，比如tag，about这些。draft的文章不会被渲染出来，page 只能通过标签栏访问。草稿写好之后在复制post文件夹，觉得hexo的命令过于繁琐，文字工作者就应该搭建好再不折腾。（我应该没脸说这个话） 渲染方法1234567title: 标题date: 2021-01-22 #时间tags: # 标签 - blog - hexotoc: true # 显示目录categories: blog #显示分类 折叠文章用，不喜欢改框架里的JS代码 https://sherlockgy.github.io/2018/06/03/Hexo%E6%90%AD%E5%BB%BA%E5%8D%9A%E5%AE%A2%E2%80%94%E2%80%94%E5%AE%9E%E7%8E%B0%E6%96%87%E7%AB%A0%E9%98%85%E8%AF%BB%E5%85%A8%E6%96%87/ 404页面404页面和page页面地位一样，404文件夹+index.md, 网上也有很多好看的404页面可以借鉴，不过本地调式的时候不显示，部署之后就有了。 附件yml文件附件找的根目录是source，所有图片什么的放在source/images下就好。","link":"/2021/01/22/%E5%8D%9A%E5%AE%A2/hexo%E6%B3%A8%E6%84%8F/"},{"title":"icarus主题","text":"icarus主题集成了很多东西，比如回到top，站内搜索，不必再使用npm来安装一些额外的包，应该是减少了些渲染的时间","link":"/2023/01/22/%E5%8D%9A%E5%AE%A2/icarus%E4%B8%BB%E9%A2%98/"},{"title":"家有吃货之自制纯肉肠","text":"淘宝买的猪小肠的肠衣，以前也使用过其他肠衣，效果不好。基本上是腌渍的肠衣，回来用料酒泡了一个多小时，然后用水冲了几遍场子内部，看看有没有坏的地方，有小孔不影响灌肉的可以忽略。 趁着清洗肠衣的时间调制肉馅，用绞肉机打碎，加上卖家的肉料（其实也可以自己调制），每斤肉加入30g淀粉，用来填补肉之间的孔位，红曲粉看颜色放入，差不多一斤肉0.5g的样子，主要为了颜色发红，多了会暗红。这个添加剂据说无害。最后加入葱姜水，六斤多肉我放了两碗。搅拌到最后越来沉，是在没力气搅拌的拉丝，直接就下一步了。 使用用灌肠神器，其实就是一个大号针管。视频里都是很顺利的灌进去了，我这个有肉堆积的现象，然后得用手一点点往下缕，不然会撑到爆开。 把肠衣完全套在神器上。灌好之后用绳子打结，分出每根的大小，最好打两层的绳子，保证切的时候不会破坏肠衣，然后用牙签戳，防止煮的时候肠衣爆开。完事之后进行风干操作，屋内低温自然2小时或者烤箱30风干30分钟。 风干之后可以继续扎眼，然后冷水下锅煮，中间可以自由翻面，有明显气泡可以直接用牙签戳破。全程小火，开锅了就加凉水，40-50分钟之后香肠都飘起来就可以了。记得扎两层绳子，防止切的时候肠衣剥开。 煮好的香肠可以冷冻上，吃多少烤多少，煎炒烹炸都可以。烤箱的话180度15分钟就可以，想吃脆皮的可以多烤一会。 基本上做出来的和网上买的火山石烤肠相差无几，不过自己家做的纯肉的，99. 99%纯肉，外边的比不了哦。","link":"/2023/01/15/%E5%90%83%E8%B4%A7%E9%A3%8E%E4%BA%91/%E5%AE%B6%E6%9C%89%E5%90%83%E8%B4%A7%E4%B9%8B%E8%87%AA%E5%88%B6%E7%BA%AF%E8%82%89%E8%82%A0/"},{"title":"","text":"1。 从需要的地方开始阅读2。 先掌握概念再细读3。 如果以上不奏效，从头开始手抄。按照时间间隔来衡量学习效果，每隔25分钟看学习了多少。","link":"/2023/01/23/%E8%AF%BB%E4%B9%A6%E6%9C%89%E6%84%9F/%E4%BB%A3%E7%A0%81%E4%B9%8B%E9%AB%93/"},{"title":"吃掉那只青蛙","text":"准备就绪（确定自己想要什么 —-【目标，理想】） 精心计划每一天*（早list,晚上 回顾 + 第二天计划）周计划？ ABCDE法则 + 80/20 （集中精力到20%上） 不同的任务分配不同的优先级 专注于最重要的工作 你永远没有足够的时间去做所有事 6p公式（proper prior preparation prevents poor performance）事前准备能够避免不良表现 在自己的领域渊博（认真完成任务） 擅长的领域精益求精 找出弱项（集中精力清除） 一次一个汽油桶（任务分解） 挖掘最大潜能 + deadline 推迟意义不大的工作 先难后易","link":"/2018/10/25/%E8%AF%BB%E4%B9%A6%E6%9C%89%E6%84%9F/%E5%90%83%E6%8E%89%E9%82%A3%E5%8F%AA%E9%9D%92%E8%9B%99/"},{"title":"","text":"1.两分钟法则如果一件事可以在两分钟内完成，比如回复邮件，一个简单的家务，就立即完成，因为记住它、计划时间、在后来完成它，可能会花费五分钟甚至更多的时间。 2、五分钟法则拖延症是影响工作效率的大魁首之一，想要治愈它不是给自己定下目标、下定决心去完成一项大任务，而是只在那件事上花五分钟。你会发现在大多数情况下，它在超出五分钟的时候依旧很顺利，因为你已经进入了平坦期。 3、不要坚信自己的记忆力很强悍即使你是一个记忆天才，也要把每件事都从你的脑子里清理出来，并进行记录，方法不重要，可以把它们写在一个笔记本里，也可以放进专门的应用里等等。 4、30分钟专注于一件事在30分钟内只做手头上的事，不去理会其他任何事，没有电话、没有邮件、不说话、不看QQ消息提醒，除非发生火灾。当然，如果老板找你谈话例外，这是没办法的事。 5、尽量保持睡眠时间，白天小睡睡眠少可能导致许多能力退化，不是危言耸听，美国军方研究表明，“每天少睡 1 小时持续一周会导致相当于 0.1 血醇水平的认知退化”。 《睡眠的秘密世界》指出：熬夜之后无论白天你干得有多好，情绪也不会太高。更重要的是前瞻性思考能力、行动的意愿、对冲动的抑制力、乐观程度、同理心、情商等也会下降。 所以，白天小睡真的是个好习惯，你没有发现爱熬夜的自己变笨了吗？ 6、总是戴着耳机戴着耳机不一定在听音乐，这可以防止别人接近你、打扰你。有些人听音乐时工作效率更高，比如小编。 7、程序员离开手机一会儿真的没关系工作时把手机调成静音，放在眼睛看不到的地方，可以分批集中时间处理电话短信。 还有邮箱也一样，不用一直去关注，特别是放在早上和晚上处理，把需要解决的和代办事件列表连在一起，有用的存档，做到邮箱清零。 8、MI3早上理出最重要的三件事，或是改成一件必做的，3件应该做的，或是五件可以做的，然后开始做最重要的一件事。不要认为意志力可以解决一切，把最重要的事情放在早晨做，并且尽可能地让所有事情自动化（委托，分批等等）。 9、有计划的拖延你的大脑需要休息，并且有时候新一期的绿箭侠可以比最好的TED演讲创造更大的奇迹。 10、假装无能有时候假装无能能让你更有精力去展示自己的能力。 11、不追求完美，程序员更不需要达尔豪斯大学的心理学教授 Simon Sherry 的完美主义与生产力研究发现，完美主义是生产力的绊脚石： 完美主义者完成任务需要花费更多的时间。 完美主义者因此等待完美时刻而耽搁。就商业而言，如果你等到了完美时刻时间已经太迟。 完美主义往往因为一叶障目而不见泰山，因为过于关注小事情而错失了大场面。 所以，真的，差不多就行了。 最后，还有一个方法就是把信用卡刷爆，当你觉得对工作不满意、没动力、效率不高时，去把你的信用卡刷爆，绝对鸡血满满，这个方法只为大家开心一下，要是这样还没动力： “吃苦耐劳”真的是优良品质吗，与你怎么做相比，老板们应该更关心你做了什么、达到的效果。所以，效率，还是效率，希望这些实用小技巧对大家有所帮助。","link":"/2023/01/23/%E8%AF%BB%E4%B9%A6%E6%9C%89%E6%84%9F/%E6%95%88%E7%8E%87max/"},{"title":"","text":"重读《自控力》，几点感受如下： ###1.意志力是可以消耗的、意志力像肌肉一样，是可以消耗的。 2.容忍罪恶，自我救赎中国自古以来的耻感文化不利于自我救赎，会造成轻微的心理创伤，时间长容易患抑郁症，什么都不想干就是对当前的行为表示不满，并且没有更好的方法。 3.意志力会传染一个好的团体至关重要。 4.我不要的我力量不要想一头粉色的大象，你的脑海里出现了什么呢？ 5. 拥抱无聊允许自己就这样的活着。","link":"/2023/01/23/%E8%AF%BB%E4%B9%A6%E6%9C%89%E6%84%9F/%E8%87%AA%E6%8E%A7%E5%8A%9B/"},{"title":"","text":"野兽特征 第一点 讨厌难的事情 （为了防止浪费能量） 对所以刺激都有反应 （并行处理） 力量大 （处理速度快） 驯兽师 第一点 逻辑导向 （只能串行处理） 能力消耗大 （很多依赖大脑的工作记忆） 力量弱小 结论 第一点 驯兽师无法战胜野兽。（战斗力，野兽是发散意识，驯兽师是集中记忆 世界上不存在擅长集中注意力的人。（重新来过就好） 如果能引导野兽，就能获得巨大的力量。（信息干消耗专注力） 给野兽喂食填饱肚子，和咖啡（减少疲劳感，专注时间会变长，150-200mg咖啡因） 和咖啡的原则 不要和太多，超过300mg效果消弱，400mg产生副作用 咖啡加速牛奶或者奶油（有些人心跳加速可以缓解） 起床90min内不喝（防止和皮质醇冲突） 2B-Alert（请google，一个美国的算法） 和绿茶一起喝（咖啡因 + 茶氨酸 效果提升） 饮食方法补充必要营养 铁、锌、镁等矿物质 维生素D 叶酸、维生素B12 ω-3脂肪酸 胆碱 必需氨基酸 S-腺苷甲硫氨酸（SAM-e） “MIND”饮食（多吃对大脑有益的，少吃有害的，不限制卡路里） 良好饮食习惯，记录mind饮食法的日期 专注力日志+记分板（记录专注多久了） 当成游戏①增加有效的获得回报的预感。②减少无效的获得回报的预感。 影响注意力的因素（单调乏味，难度不对） 内观和正念 意志力会越用越少 控制自己会消耗能量 能力用尽无法控制 已经否定了补充糖分理论 观察自己 观察自己所想，比如目前状态，走路状态， 走神之后拉回来，然后继续 一次只做一件事，吃饭的时候不要刷剧 幻想平静的场景 工作环境 专用空间 专用设备（工作手机电脑和生活手机电脑） 账号分区（同工作和生活） 内容拦截（短信和广告） 噪音管理（降噪耳机） 自身性格（外向音乐加强效率，内向降低） 纯音乐（歌词会降低专注力） 工作间隙听音乐 适当记录情绪（比如无聊，焦虑，把情绪物质化，像什么。。。 观察情绪而不是控制 学会放弃和休息很多人会有如下误区，在众多的压力中，自责是伤害最大的。所以要自我接纳。 ①过分追求专注力。②过于责备自己没有专注力。 既然事情已经发生了，接纳就好，不需要评判，只是去观察。 做一些补救的办法，尝试相关的新事物（有优势的，能学到东西的） 休息的方法 微休息(几十秒到几分钟) 任务休息（和番茄工作法类似。不过是防止休息跑远了，在复杂任务间隙做简单任务，达到休息的目的。降低大脑运算速度。 积极休息（休息时做温和的运动，比如定期散步） 超积极休息（高专注力的多巴胺，剧烈运动释放压力） 美军睡眠法（从头到下冥想放松） 偶尔睡个午觉（自己加的，毕竟多阶段休息）","link":"/2023/01/23/%E8%AF%BB%E4%B9%A6%E6%9C%89%E6%84%9F/%E9%A9%AF%E6%9C%8D%E5%A4%B4%E8%84%91%E4%B8%AD%E7%9A%84%E9%87%8E%E5%85%BD/"},{"title":"potplayer的aws实时翻译插件","text":"","link":"/2022/12/30/%E9%80%A0%E8%BD%AE%E5%AD%90/potplayer%E7%9A%84aws%E5%AE%9E%E6%97%B6%E7%BF%BB%E8%AF%91%E6%8F%92%E4%BB%B6/"},{"title":"视频字幕提取","text":"","link":"/2022/12/30/%E9%80%A0%E8%BD%AE%E5%AD%90/%E8%A7%86%E9%A2%91%E5%AD%97%E5%B9%95%E6%8F%90%E5%8F%96/"},{"title":"佛•教化•屠杀","text":"东鸡冠山迷了路，误闯了田间的坟地。 以至于到了日俄监狱，那份恐惧仍旧没有消失。高高厚厚的城墙，勾起了几年前途经伪皇宫的回忆，如果说高城壁垒是为了防止犯人逃窜，那么皇宫岂不是帝王将相的牢狱？这样想着，愿生生世世莫生于帝王之家倒是一种悲哀的绝唱了。 事实上，穿过城墙，里面并没有想象中的庄严，本以为这里的冤气会压迫灵魂，让人窒息，事实上是，一路惊魂未定，却连一丝血腥气都未曾嗅到过。 监狱明显翻新过，若是复古风格，经历过枪林弹雨的山石和被抓破了的淋满殷红的墙壁才与它相称。角落里卧着的一口大钟倒是引人注意，介绍上说，这是日本帝国主义卑劣行径的体现，过去每天都有僧人到这里来超度，借以来消磨人们的反抗意志。看到这里我无意为日本开脱，若是余生充满痛苦，透过佛法来看世界倒是一个不错的选择。佛教从古印度传到中国，日本，最后成为世界三大宗教之一，自然是可以为大众消灾解祸的。这里仅仅表明立场，不做任何评价。 不过倒是想起了关于安倍的一则新闻，安倍夫妇通过初等教育渗透“爱国主义思想”，那么这些东西就像一种信仰，正在这些孩子们大脑中根深蒂固，那么与宗教，还有我们从小被培养的抗日情怀，其实都是同样一种意识形态。 整个监狱不大，猜测犯人不足一千，里面有很多过去工厂的牌坊，现在一些关闭，一些则摆放一些遗物供人们参观。大概以前犯人们就都在这里劳作。还有医务室，对于重症的病人，当然安安静静的等待他们死去。因为在这里最便宜的就是人命，人命是换取劳动果实的易耗品，当然也是供这里的人取乐的工具。把犯人双眼用黑布蒙上，让其跪在地板上，然后把脖子套进绳索，再把木板抽走，人就掉在了几米之下的木桶里，然后被几个同伴默默地抬起奔赴坟场，狱卒在后面举着短枪，准备随时扣下扳机。 复原图倒是有几具骷髅，混着朽木和尘土。当然我十年前在黑龙江省博物馆便见过真实的骨架，除了不理解为什么手心那里是凹下去的，其余并没有什么意外。小时候也埋葬过燕子，所以对骨头并不怎么畏惧，也不觉得好端端的一个人忽然变成一堆白骨有什么奇怪的地方。那个年代，人命真的是不值钱的，有些人终其一生不过吃了几颗枪子而已。 那么与那时相比，我们是否更加幸运？当然是否定的。那时的冲突是意识形态，现在则是文化断层。我们是否要缅怀先烈？那也不必，这种历史不会再重演。若是生在战争年代，那么终生梦想便是世界和平，人生安稳。现在一定与那时不一样。有人说历史一共分为三种：第一种是已经逝去的岁月，往事不可追忆；第二种写在了各类史诗典籍中，可能迫于当时时局，略加修改；那么第三种便是自己阅读各类典籍，加上自己的心得体会，认为历史应当是这个样子。那么历史是不必躺在水晶棺中任人观赏的了。与华丽相比，应该更接近于真实。 那么现在中日关系如何？我们作为小人物当然不想太清楚。国际上有一条交友准则，没有永恒的朋友，只有永恒的利益。从旅顺回到大连，写下了这样的话： 旅大是日本的情妇，被百般虐待，所有的灵感都来源于她，荣誉则是成为一份作品，而毁灭也恰好是她。","link":"/2017/10/06/%E9%9A%8F%E7%AC%94/%E4%BD%9B%E2%80%A2%E6%95%99%E5%8C%96%E2%80%A2%E5%B1%A0%E6%9D%80/"},{"title":"房间","text":"他还是饶有兴味的看着戏剧。对他来说没有什么比戏剧更能打发这个黄昏了。他在想他的妻子在他身边该有多好。前一天他们吵了一架，她一气之下离家出走就再也没有回来。现在他只能在这个没有几个观众的看台下，痴痴地望着台上，当然心里想的还是他的结发妻。只不过他的戏剧能让他感觉稍微好些。 “先生，麻烦你跟我们走一趟”两个警察模样的人出现在他面前，冷冰冰的声音划破了这一沉寂。我们这位好好先生可是从来不问缘由的，更何况他觉得自己也没犯什错。甚至于老婆吵架时，他都是默默的承受着家庭暴力。 这次的目的地不是警察局，竟然是他的家里。屋中仿佛听见一男一女在吵架，女的似乎在咆哮：“看你昨天带回来的那个小男孩，再这么养下去我们都要穷死了！”男的成熟稳重，但也极富心机，他似乎都看不到那人的脸。那人说的每一句话都好似千斤：“我自有安排。”那个女人的声音听起来好像他的妻子，不过凭着他对她的相信，这一荒唐的想法很快就被否定了，哪怕他们只是新婚。就算新婚之夜他们刚刚吵了一架，他们也相信彼此都知道，两个人的完美主义还要慢慢磨合。世界上绝对没有任何人可以替代彼此的位置。本想等她气消了之后再和他一起游山玩水的。结果他发现现在像重物一样被人摔在地上，然后被拖进了一间黑屋子里。 清醒了一会，他发现这个屋子的布局竟然和他家一模一样，而且他也告诉自己，仅仅是相似而已。这个黑屋子很像是他的卧室，只不过没有了灯，整个屋子就好一间暗房。他瞪大眼睛似乎不敢相信这是真的。难道是谁要向他复仇吗？怎么选择了个这么相像的地方。他是个好好先生，但是也得罪过不少人。慢慢的，他发现这个屋子里还有其他人。角落里蹲着一个小男孩，目光有些呆滞，衣衫褴褛，头发也有些凌乱，而且无论他怎么喊，男孩就是不理他。男孩的周围，有一排排的月饼礼盒，上边贴满了个各种情绪的标签。走上前，他看见“智慧”和“勇气”，他曾经毫不犹豫的选择了前者，不过他觉得现在应该换个决定了。只不过男孩前面标有“自卑”与“抑郁”的盒子已经空了。“哎，今天可是中秋，看来今晚是很难见到月亮的了。”他自言自语道。 还好是中秋，月光可以透过这些黑暗，给每一间黑屋子带来光明。“喂，你看见前面那扇窗了吗？打开它，我们就可以出去了。”男孩仍然不理他，径直向前，甚至连头也不回。“终究还是孩子。”他一边叹着气，一边跟了过去。走了几步他就看见一个小女孩的骸骨横在前方，月光下显得格外阴森。而小男孩由于留恋外边的新鲜空气再也听不到他的声音了。就好像月光之下有塞壬的歌声似的。 他也不晓得为何清楚的记得过去了两周，大概是处于艰难险境的人对时间更为敏感吧。小男孩最终还是倒在了小女孩的身旁。“是我害了他。”不过这句话他没有说出口，因为他的身边已经没有其他人了。求生的欲望越来越强烈，回过头，门是虚掩这的，而且无论如何都无法反锁。他想过从这扇门中穿过去，只不过竟然有些怕那些人都聚集在门口，他一时间招架不住，于是还是选择跳窗。 不知道是已经没有退路还是求生的愿望过于强烈，拉开窗户，几个跟头，他就翻入了下一层。 虽然是高层，但是还是阴森森的像一个地下室。昏黄的灯光下边，照亮的几处蜘蛛网。他只有拼命的奔跑，只不过这里除了实验室还是实验室，难道这里住着一个和他一样的工作狂吗？他很清楚他这样很快就会被后边的人追上。“快过来这里，这里很安全！”走近细看，那人竟然是他的姑姑。他也来不及多想了。 暂时松了一口气，他瘫软在地上，余光扫过地面，一批批的黑影掠过。那她姑姑呢？为什么他可以随意走动？为什么她知道知道这里就是绝对安全的？为什么……难道？他不允许自己再这么想下去了。 “他就藏在这里。快点！”一个似曾相识的声音，十分钟之前是如何告诉自己这里是如何安全，现在有是如何把自己推向绝望的深渊的，当然这就是人性，他早就已经见惯，这次却疏忽大意。当然他终究是个理性的动物，抓紧门锁，外边向右转一圈，他就向左转一圈，累了就干脆锁死，就这样一直僵持着。 “无论如何我也要救我的孩子。”门外传来一阵叹息。 母亲受人驱使只是为了救子吗？他的心忽然颤了一下，他知道这种情况母爱是绝对不会讲道理的。他松开门锁，放弃了抵抗。 “你要用我来换你的孩子可以，但是我出去一定杀了你！”这话他是吼出去的。 “好！”对面毫不迟疑。 门开了。 里面走出了一个瞋目怒视的人 ，浑身散发着杀气，仿佛眼神都可以杀人。只有那个为了救儿子可以赔上性命的人还站在那里，似乎在等待最后的仲裁。现在两方都已经切身感受到，面对死亡本身就该无所畏惧。 随从的人早已经被吓破了胆，她还是义无反顾的站在那里，他死死的扼住她的咽喉，哪怕是他的长辈，哪怕帮助过他又马上背叛了他。这些他都不再想，因为他早已经被愤怒所淹没。他死死的攥住她的脖子，仿佛下一秒就能像向捏死一只蚂蚁一样捏死他。只不过，他突然松开了手。“带我去见他。你快点！”冷冰冰的语气，一点亲情的味道都没有了。她不回应，只是不停的咳嗽。 回到了之前的地方，之前的一男一女早已不见，地下只剩下一个破旧的书包，是他少年时期用过的，他解释不清楚。黑屋里走出个人影，正是先前日子倒下的小男孩，不同的是，他变得干净帅气又阳光。“是你救了我！”男孩嘴角上扬。 “我要去报警。你去自首？”这位好好先生第一次表现的这么富有攻击性。 去警局的路上，之前发生的一切好像都消失了，就连那件屋子也在慢慢的崩坏。路的尽头，她的妻子在等着他，她也经历了同样的事。她首先打破了这一宁静，“亲爱的我想写本书。” “嗯？” “你之前不是说过每个人走不出自己的世界吗？” “那你这本书的名字就叫做《房间》好了。” “这是一个主人格被邪恶人格囚禁的故事。” “而且主人格终将获得胜利。” 他们彼此一次笑，又是黄昏，落日的石阶前，一切坎坷都被照的透亮。","link":"/2018/02/06/%E9%9A%8F%E7%AC%94/%E6%88%BF%E9%97%B4/"},{"title":"udemy 限免课程","text":"100% Off Udemy Coupons &amp; Promo Codes September 2022","link":"/2022/10/06/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/udemy%20%E9%99%90%E5%85%8D%E8%AF%BE%E7%A8%8B/"},{"title":"举报措施","text":"我们都是心思单纯的孩子，在社会这个大熔炉每天都被刷新着三观。国有国法，家有家规。而步入社会之后，可能每天都要面对一些垃圾。人和垃圾人的保护伞。 那么，请拿起法律保护好自己。同时，在不违反法律的前提下，尽最大可能争取自己的权益。 一定不要委屈自己迁就别人！！！ 打官司： 微法院北京法院电子诉讼平台 apple的软件：苹果电脑贸易上海有限公司 北京朝阳房管所： 64186037北京朝阳 # 偷税漏税举报流程 北京市税务局官网[^1] -&gt; 互动交流 -&gt; 税收违法行为检举 里面有【我要举报】和【回复查询】 12345 也就是原来的12315，公众号和电话是不一样的，最近有app了好像","link":"/2022/11/06/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E4%B8%BE%E6%8A%A5%E6%8E%AA%E6%96%BD/"},{"title":"北京租房心得","text":"房屋选择 刚毕业租房是40平米的公寓，实际也有30平，租金是全部的实习工资。学校蜗居够了，不想再委屈自己。来北京就只能合租了，一般中介都会虚标房间大小和朝向，还是得实际去看房。看房子的话，心理先有个预期，如果没有心仪的房子怎么样。如果是地下室或者一楼性价比再高也不要去看了，尽量租新一点和治安好的房子，北京老破小太多了。看了没相中只会浪费时间。职场人首先要活的体面一点。 不要觉得房子只是一个睡觉的地方，起码的生活设施要有：稳定的水电网，燃气和隔音(手机有很多app可以测试分贝，大于60的房子就不要选择了)。而且疫情影响居家办公已经是家常便饭了。贵点不怕，总之还是要让自己觉得舒服。 朝向： 南&gt;东&gt;西&gt;北 如果不是实在差钱的话，还是建议住在公司附近或者通勤方便的地方，很多人说单程一个半到两个小时。五环以外都是村里了，基础设施和人文设施和市里完全没有办法比，为了省心的话，还是住在繁华地带，毕竟一边工作也要一边生活，不然去市里总有村里孩子进城的感觉。二来北京可以玩的地方很多，地铁站附近去市中心也就半个小时。通勤要算往返时间，尽量减少换乘的等车时间，单程半个小时往返就是一个小时。能坐地铁不要坐公交，人多很挤，乘务员人工报站，还要维持车内秩序，没有降噪耳机的天花板建议慎选公交通勤，无听之于耳很难，很消耗精力。就算下班晚，23点左右公交都没有座位。另外北京有共享单车，可以选择单车+地铁混合交通，单车会员每个月15左右。 不建议极端天气去看房，会漏调一些点。一定找不要临街的房子，五环以为打车没有管制，窗外24H大车通行。 租房好物第一条，选择搬家好搬且轻量的东西，买之前想好搬家怎么处理。然后才是其他，同城搬家可以无视，因为有某拉拉这些，百元以内师傅给搬(非广告，遇到的师傅可以，但是app做的很差，客服跟僵尸一样)。毕竟北京房租高，自己买点小玩意跟房租比根本微不足道，就任性的买买买吧，毕竟以后结婚了就不一定有机会了。(最近看中了一套设备10W+， NUC12飞龙峡谷和M1 Ultra双机双显示器，apple官网推荐的屏幕) 工作效率物品（电脑和显示器台灯）现在基本都离不开电脑，有大桌子的买大显示器，否则就15.6便携屏（typec一线通），还能带去图书馆。建议双屏或者带鱼屏，幸福指数提升很高，MacOS用户可以用slide bar，win用户用duet都可以把ipad当作拓展屏。建议显示器预算2000左右，分辨率4K@60HZ。现在轻薄本也性能炸裂了，没必要买大机箱，台式机的话Macmini和NUC，APU都是不错的选择。 关于机械键盘，如果你的房租隔音好，放心用青轴和茶轴，万一被听见，还能给人留下半夜认真写代码的印象。 嗯，夜深人静的时候一定要选一个暖黄色的灯光，会觉得柔和放松。 还有，多备用几个插排，自己备个路由器，防止别人在公用路由看见你的设备和智能家居。 生活用品大型洗衣机（4L左右）：自从在学校看见有人用公共洗衣机洗鞋，再也不用这玩意了。某鱼，某宝，某东500以下能买到很好的。（个人觉得别人买的洗衣机最多值200） 内衣洗衣机： 懒癌晚期，不想手洗，还有内衣洗衣液。 洗鞋机： 因人而已。 便携式烘干机： 如果不是朝南建议入手一个。 消毒酒精：家中常备，可以买个自动喷酒精的机器 降噪耳机： 2000左右买个降噪耳机绝对值得，就当投资自己吧，开降噪听着音乐假装进入元宇宙。 厨具：单身贵族不推荐了，能清水煮就行了。毕竟打折券很多，北京很多美食羊毛可以薅。豆浆机是个bug，大的豆浆机一个人喝不完，小的费半天劲就一杯还得浪费时间清洗。 灯具：自己可以换个好的搬家拆下带走，如果中介免费给换就更好了。 窗帘： 自己可以换个好的搬家拆下带走，没必要买自动电机。 拖布和苕帚：自己屋里备一个吧。 垃圾桶和垃圾袋： 不多说。 床上小桌子：不知道为啥不给上床下桌，床上是真舒服。 即热饮吧： 3S出热水，适合早起时间紧张的职场人 公交卡：手机NFC 不得不面对的人室友你的预算够了，遇到素质高的室友概率也会大大提高。当然能租开间最好，群租大家回家都是各回各屋，交流极少。 出于公共资源利用效率考虑，还是建议和室友们错开起床和睡觉时间，判断一副眼镜舒服的标准是你感觉不到它的存在。好室友的标准也是也感觉不到他的存在（eg：你上班了，他还未起，你睡觉了，他还没下班回来） 有些女室友通常不化妆不见人，所以女室友洗衣服做饭的时候就委屈一下错开空间吧。 中介一定要找个靠谱的中介，你第六感有一丝丝不舒服就不要租了（比如看起来就不厚道的人），因为不知道以后还有什么狗血的事发生，进入的社会才发现，很多的人不要脸的没有底线，无底洞。高素质的人没必要惹这个气受。如果你觉得中介不给办事但是自己可以解决的话，还是建议不要浪费这个时间，北漂人时间很宝贵，不管你是996还是965。 比较靠谱的: 链家 我爱我家 暖房小程序 豆瓣租房 小红书好像也行 自如（但是房东租客两头吃，但是大家都图省心忍气了） 据说假房源很多，低价吸引的： 安居客 58 哪个中介都会有一些负面信息，房东直租也有坑，记得用法律手段保护自己，50块开个民事诉讼之类的。 慎选小中介！！！！！！不要先交定金 （如何投诉黑中介，待补充） 房东如果是和房东手里租，查好房产证和房东身份证，留作证据。 从中介手里租的话，随便怼房东吧。（不清楚房东和中介的py交易是怎么样的） 不要怕麻烦别人公共区域基本都是先来先占用，不需要过于考虑其他人感受，毕竟大家都可以放东西，别太乱到过分就行。毕竟花钱租了房子，说话硬气点。记得查好水电价格。 每个人的忍耐程度不同，不要人云亦云，说你事多的直接怼回去，毕竟都是试探对方底限。别委屈自己迁就别人。 最后关于GTD跟你说GTD没用的都是没做好的，靠脑子真是记不住，冥想+GTD+复盘，形成规律，别在决策上浪费时间。 北漂人很忙，但是不要慌张。","link":"/2022/04/23/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E5%8C%97%E4%BA%AC%E7%A7%9F%E6%88%BF%E5%BF%83%E5%BE%97/"},{"title":"","text":"好物分享办公无线打印扫描一体机照片打印机实木电动升降号桌4K显示器要带菊花链 墨水屏显示器移动固态人体工学椅降噪耳机现在有airpod pro2， qc45，华强北airpod Mesh路由屏幕挂灯随身WIFI娱乐4K投影仪吊椅地投幕布 生活即热饮吧自动烘干机全自动扫地机器人可以自己换水自己换垃圾那种 自动拉窗帘家庭中枢 HomePod * 3全屋智能家居定制智能门锁智能猫眼家里要布置的电子设备电脑设备4415U缝缝补补还能再战三年 网络10G 内网24口交换机机柜","link":"/2023/01/23/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E5%AE%B6%E5%B1%85/"},{"title":"小米Ax5400双宽带叠加","text":"硬路由宽带叠加作为临时解决方案，目前只有AX5400和AX9000支持，并且只能是不同的运营商。 高级设置 -&gt; 其他 -&gt; 双WAN设置 注意： 1.开启双WAN功能后会与部分功能冲突，若仍想使用冲突功能，请先尝试关闭双WAN后再试 2.若某些终端设备出现金融类app无法正常使用的情况，可尝试在“WAN口策略”功能中将该设备设置为“WAN1优先”或“WAN2优先”后再试 3.请勿将WAN1或WAN2口与其他Mesh组网设备相连 设置完成的结果","link":"/2022/05/06/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E5%B0%8F%E7%B1%B3Ax5400%E5%8F%8C%E5%AE%BD%E5%B8%A6%E5%8F%A0%E5%8A%A0/"},{"title":"","text":"乐歌自动升降桌 E6—HD 双4K显示器(philip，samsung) NUC8 黑苹果(双系统，内存64G) Ipad air5(apple pencil2 + magic board) 无线打印机(Lenovo M7400 Pro 改) 键鼠(Ikbc，logtech) 耳机(Bose QC 45，Airpod pro 2) 小米路由器AX3000 山特UPS NAS(QNAP 453Dmini， 内存64G) EXSI双软路由(ikuai + openwrt) 小米台灯PRO 公牛插座6排 * 2 绿联Gan 100W 8K typec 视频线 apple magsafe","link":"/2023/01/23/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E5%B7%A5%E4%BD%9C%E5%8F%B0%E6%94%B9%E9%80%A0%E8%AE%A1%E5%88%92/"},{"title":"生活小妙招","text":"### 冰箱去霜 开水倒入不锈钢盆，放入冰箱，几分钟之后冰块就掉下来了 ### 锅去顽渍 白醋和小苏打浸泡一会就可以擦掉了，注意铁锅不能用 ### 玻璃水杯 尽量买双层的隔热杯，防止烫手，单层玻璃不管用。","link":"/2020/01/15/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E7%94%9F%E6%B4%BB%E5%B0%8F%E5%A6%99%E6%8B%9B/"},{"title":"2022年6月2日 北京医院拒诊（中日友好医院）","text":"凌晨5点50.大概是被疼醒，流了一夜的血，床单被罩都是血，昨晚处理伤口到1点半，伤口有些深，于是跟领导请好假，和同事交接好今天手头的活，于是开始在各个医院打电话。 太早了没几个电话能打通，无奈只能120 你要救护车吗，我们只管派救护车。高德上电话基本打不通，114很不耐烦的说已经查了三个电话了，直接转了机器报号。附近药店只卖药不处理伤口。打了一个多小时电话，终于有个电话能打通了。这几天没出小区就没做核算，也防止交叉感染。中日友好医院，给了三个方案：1. 120直接能进，显然我神志清醒，不用这个 2. 去发热门诊，等着核酸结果，核酸结果出来不能走3. 等核酸结果出来再看病，估计我也快失血过多了，要是昏倒在路边估计也没人搭理。没办法，硬着头皮打车去医院，于是挂号，门诊发了N95，说我万一是阳性这就得关门了，没办法只能说拿人头担保。 发热门诊要求了核算和流感抗原，好说好商量下，门诊某大夫说已经通知外科大夫过来了，等了好久，外科那边只有一个大夫，说病人多，有空过来，于是问多久能过来，有没有给个时间什么的，回答是没有，体制里的托词，懂得都懂，看来要把我一直晒这了，没办法只能继续磨门诊大夫，反正门诊这人也不多。过了半个多小时，某大夫给写个了条，告诉我直接过去门诊外科就行。一瘸一拐找了半天路，敲开外科大夫的门，礼貌说着刚才的情况，外科科室1里面只有一个男大夫，大概四五十岁的样子，因为刚刚发热门诊大夫已经打过招呼了，于是简单说明情况，对方一副不耐烦的样子，哪个门诊？哪个某大夫？然后把我赶出诊室，没办法只能给门诊某大夫打电话，外科大夫在电话里跟某大夫说，意思病人没有持续性出血，有纱布包扎止血，等核酸结果吧。其实纱布是我自己出门简单包扎的，给大夫看伤口时，纱布往下掉了点，很多干的血迹，裤腿有点紧，还没掀到伤口那，大夫扭头就回诊室了，扔下一句，你这没有持续性出血，俨然一副趾高气扬的样子。我的腿还流着血，我也不知道还有没有命等核酸结果出来。于是质问他是不是今天今天我死在这你也拒诊。“是，我不能违反国家规定，没有48小时核酸不能进手术室”说完大夫扭头就进屋了，和他确认刚才说的话，他似乎也察觉到了说错了话，转过头就不认了，就说国家规定什么的。录音我会上报有关媒体，之前这样的事已经民怨载道了。保安凑过来了，目光盯着那个医生，我的腿还流着血，我尝试跟保安解释，这个医院是不能呆了，就没想好好给治，再来个公报私仇犯不上。估计大家都看新闻了，也没人出来拦着我。后悔当时没有直接报警。或者不讲中文用日语跟他们说。 我也是第一次有底气敢和人吵架，没想竟然在三甲医院。古语讲医门多疾。现在的医生不要求有医德，不要求跟病人好好说话，能把本质工作做好就可以去了，不要求不给开太贵的药。当然不是针对所有医院，仅仅用这个医生举例子，大家结合自己经历自行脑补就好。自疫情开始，多少人因为医院的政策问题被拒在门外，本人命大两次死里逃生，上次是打疫苗之后发烧39度，窗外下着暴雨打着雷，我要去治疗发烧却因为发烧不能看病。否则需要做抗原四项，一共770。再等4-6小时出结果，期间不能离开，发烧39度在急诊那个环境呆半天估计是直接去另外的世界了。一年之内就遇到两起拒诊案件，其他人呢？因此去那个世界的人呢？和变相杀人有什么区别？不作为故意杀人罪可以进局子了吧。这种没有医德乃至道德的人直接革职查办，行政拘留吧。（不作为故意杀人：处死刑、无期徒刑或者十年以上有期徒刑;情节较轻的，处三年以上十年以下有期徒刑） 中日友好医院是压死骆驼的最后一根稻草，北京又如何，上海又如何？6月1日，上海刚刚解封。6月2日北京就重复上演这样的事情，把国家政策当挡箭牌，把百姓的命不当回事。自古有之敢冒天下之大不韪，杀伐决断，后来的人称之为任侠。古来救死扶伤，而今一个个伪君子，在其位不谋其事。 发文可能会被网暴，键盘侠从来不会关心你过的好不好，放心我不会自杀。不想做一个忍气吞声苟活于世的人，洪流之下，很多人都活成了龙啸云。 医院不是法外之地，还轮不到地方自己立规矩。","link":"/2022/04/23/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E7%96%AB%E6%83%85%E5%8C%BB%E9%99%A2%E6%8B%92%E8%AF%8A/"},{"title":"硬件常见的坑","text":"苹果外设 秒控键盘和笔没有平替 有了homepod还需要一台手机转发，手机关机指令无效 苹果建议不低于4K，不然屏幕发糊 键盘 ikbc有时候锁定win按键 [^1] 锁定 Fn+左win 解锁 Fn+ 右win(ikbc w200实测) 电容键盘没电要使用软件给电容充电 NIZ plum静电容键盘的alt和win键互换位置: 按住Fn和侧面标注有Win/Mac的按键3秒以上，看到指示灯闪烁就代表成功切换。 typec一线通 便携显示器可以使用笔记本给屏幕供电，此时显示器作为hub 大型显示器可以使用显示器给屏幕供电，此时显示器作为hub c口ipad也可以一线通，此时显示器作为hub 部分安卓手机可以一线通，此时显示器作为hub 部分小米手机能充电，能做hub，不支持视频 显示器不支持给充电c宝供电 三星客服说vesa壁挂和支架分开的显示器不能升降旋转 大于65W/90W 以上的机箱不建议typec一线通，功率跟不上会关机 typec 用了Dock就不能一线通了，因为已经不是全功率了 4K视频线和屏幕线一般可以混着用 充电线一般是2.0，4K线可以3.0满速 100W充电宝和氮化镓 加个设备会重新分配功率 2Wmah充电宝给电脑只能支持俩小时 不用apple自家的充电头，magsafe最多10W PC typec无法充电，MacOS开机无显示器不进系统 NUC 维奇说白苹果也是没显示器不进系统 typec无法充电试试退出运输模式 电脑的坑 有些笔记本没有主板电池，内置电池用完了bios会恢复出厂设置 标称最大支持16G/32G还可以插更多内存 [^1]:IKBC键盘Win键失效的解决办法_NXGG的博客-CSDN博客_ikbc windows键","link":"/2017/10/06/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E7%A1%AC%E4%BB%B6%E5%B8%B8%E8%A7%81%E7%9A%84%E5%9D%91/"},{"title":"","text":"吃亏是福 花钱挡灾 穷人家的孩子错不了","link":"/2023/01/23/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E8%80%81%E4%B8%80%E8%BE%88%E7%9A%84%E9%94%99%E8%AF%AF%E8%A7%82%E5%BF%B5/"},{"title":"小白零基础线上配镜，拔草蔡司。","text":"购买理由网络越来越发达了，很多事情都可以在网上完成，学习外卖快递什么的比以前方便多了，甚至配眼镜也可以了。希望有一天可以在线吃饭吧。 流程先谈一下线上配眼镜的优缺点吧: 优点： 便宜，线下普通眼睛的钱就能配到蔡司的镜片 可以熟悉配眼镜的流程，防止日后被坑 缺点： 需要线下验光，线下有些家不提供验光或者验光度数不准确 眼睛框可能带着不舒服 需要3-7天才能拿到成品，没有备用眼镜的话很难受 几个月前被种草蔡司镜片，在蔡司睛选小程序上询问最普通的莲花膜也要上千，更何况我每天超过10小时面对电子屏幕，必须要蓝光膜，姑且不说是不是智商税，起码图个心里安慰，不要以为有蓝光膜就可以随便作了，眼睛病了也是病啊，就跟不好好吃饭等于慢性自杀一样。 找了几篇帖子，最终在1688上选择了一家深圳的眼镜店，我配的是钻立方的蓝光膜，应该是比较入门的一款镜片，毕竟第一次尝试，打算成功了后下一个眼镜直接上顶配。实测一周后发现，除了选镜框的时候没注意到尺寸有点小之外，其他的都算不错。基本流程就是，选镜框-验光-下单镜片-邮寄镜框-镜框加工。 镜框镜框由于经费原因没有选择蔡司原厂，在京东上选了个商务风格纯钛材质了。品牌是精工，日本的老牌子了，眼镜店里的品牌在网上都搜不到，索性买了大品牌风格类似的。 京东下单，不过还需要调货，精工店比宝岛店还便宜一些。对这镜子试了试觉得风格挺好看就联系顺丰邮寄走 了，邮费18大洋。 后期收到货的是时候才发现同样的镜框，近视镜和平镜的感觉是不一样的，也可能是第一次用半框，总会看见边框。 验光验光是在宝岛眼镜，搜索公众号选择验光师就可以了(不要选配镜师)，之后的数据会同步到小程序上，验光的费用是50,个人觉得还是挺划算的，毕竟一堆参数，验光师操作一堆设备操作起码半个小时，再加上我问了一堆问题。当然也不排除有些店嫌麻烦不提供验光服务的，去之前要电话沟通好。当然电话里说50一次然后去店里不给验光的也有。 如果想货比三家防止度数不准确的话，那么就不要去同一个连锁店了。毕竟他们都可以查到数据…… 总之，宝岛还是挺靠谱的。 镜片镜片根据需要下单就可以了，上边的加个是一片的，记得数量要选2,然后还有加工费，算上这些差不多是线下的三分之一。加工之前卖家会确定下镜框和度数，剩下的就是加工时间和物流的时间了，顺丰发出。顺便吐槽下顺丰没有之前快了。 收货收到的第一感觉是轻，毕竟配眼镜成功的标准就是感觉不到它的存在。后来觉得我的树脂镜框就像一块石头压在了脑袋上。 除了天没亮剩下的都亮了的感觉。 如何保养保养的话，买了美的超声波清洗仪，190入手。当然也可以洗假牙手表珠宝什么的。没有精力每天去洗，家里又多了一个长期吃灰的设备。 总结总体来看的话，还算挺成功的一次配镜。毕竟有句话叫做能用钱搞定的不要花是时间。懒人不止一次的为这个社会带来变革，希望有一天穷人也可以吧。","link":"/2021/10/08/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E8%94%A1%E5%8F%B8%E9%85%8D%E9%95%9C/"},{"title":"身份证科普","text":"身份证号码是由18位数字组成的，分别表示： 1、前1、2位数字表示：所在省份的代码。 2、前3、4位数字表示：所在城市的代码。 3、前5、6位数字表示：所在区县的代码。 4、第7～14位数字表示：出生年、月、日，7、8、9、10位是年，11、12位是月，13、14位是日。 5、第15、16位数字表示:所在地的派出所的代码。 6、第17位数字表示性别:奇数表示男性，偶数表示女性。 7、第18位数字是校检码:校检码可以是0～9的数字，有时也用X表示。 8、＊尾号X是作为尾号的校检码，是由号码编制单位。X是罗马数字的10，用X来代替10，可以保证公民身份证符合国家标准。","link":"/2017/10/06/%E9%9B%B6%E7%A2%8E%E7%94%9F%E6%B4%BB/%E8%BA%AB%E4%BB%BD%E8%AF%81%E7%A7%91%E6%99%AE/"}],"tags":[{"name":"家有吃货","slug":"家有吃货","link":"/tags/%E5%AE%B6%E6%9C%89%E5%90%83%E8%B4%A7/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"English","slug":"English","link":"/tags/English/"},{"name":"rosetta","slug":"rosetta","link":"/tags/rosetta/"},{"name":"效率","slug":"效率","link":"/tags/%E6%95%88%E7%8E%87/"},{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"potplayer","slug":"potplayer","link":"/tags/potplayer/"},{"name":"实时翻译","slug":"实时翻译","link":"/tags/%E5%AE%9E%E6%97%B6%E7%BF%BB%E8%AF%91/"},{"name":"字幕提取","slug":"字幕提取","link":"/tags/%E5%AD%97%E5%B9%95%E6%8F%90%E5%8F%96/"},{"name":"游记","slug":"游记","link":"/tags/%E6%B8%B8%E8%AE%B0/"},{"name":"梦","slug":"梦","link":"/tags/%E6%A2%A6/"},{"name":"学习","slug":"学习","link":"/tags/%E5%AD%A6%E4%B9%A0/"},{"name":"反抗","slug":"反抗","link":"/tags/%E5%8F%8D%E6%8A%97/"},{"name":"北漂","slug":"北漂","link":"/tags/%E5%8C%97%E6%BC%82/"},{"name":"租房","slug":"租房","link":"/tags/%E7%A7%9F%E6%88%BF/"},{"name":"外设","slug":"外设","link":"/tags/%E5%A4%96%E8%AE%BE/"},{"name":"生活小妙招","slug":"生活小妙招","link":"/tags/%E7%94%9F%E6%B4%BB%E5%B0%8F%E5%A6%99%E6%8B%9B/"},{"name":"DIY","slug":"DIY","link":"/tags/DIY/"},{"name":"生活","slug":"生活","link":"/tags/%E7%94%9F%E6%B4%BB/"}],"categories":[{"name":"吃货","slug":"吃货","link":"/categories/%E5%90%83%E8%B4%A7/"},{"name":"blog","slug":"blog","link":"/categories/blog/"}],"pages":[{"title":"404","text":"好好吃饭，好好生活。","link":"/404.html"},{"title":"关于我","text":"一个偶尔写休闲文学的程序员，曾就职于IBM，Amazon等500强公司。 早年因怀揣梦想，弃理从文，玻璃心仍在。学生时代曾为社会主流歌功颂德而写骈文。 参观日俄监狱后，文风骤变，写当下感受，后来只为内心想法所写不讲技巧不为辞藻。 曾自嘲，一个不懂电的程序员不是一个好作家。自认为目前需要用计算机知识开解决问题，比如从修电脑修路由器。自诩是专业修网修电脑修锅修水电的修家电的。 并认为，不能应用的理论知识其实就是传销，一代传给下一代，什么也做不了，如果只为一份生计，那么学计算机和学习汉语言有什么区别？学习知识应该看到理论背后的设计，不去迎合主流社会。 爱好：关于计算机的一切 软件：全栈+DOCKER+大数据+人工智能 硬件：各种开发板 不擅长的事 不擅长应试 不擅长处理人际关系 不擅长投机取巧 时隔几年重启博客，Hexo也是梦开始的地方，这里会不定时开始分享非技术相关的小情绪，比如最近新买的设备，折腾的新玩意，生活感悟技巧，以及生活中的一些小确幸，当然偶尔或者经常也会发一些对当下制度不满的骂街。 感激曾经懵懂的年纪，涉猎古代文学，心理学，庄学。好让现在能够心安理得的好好活着。 构思再好，不写出来也会被遗忘。文字再好，不保存记录下来也会慢慢丢失。 扔了很多奖状证书，很多文稿，很多工科笔记，很多记忆也被选择性遗忘掉了。在这里重新开始，不为任何人而写，不迎合社会主流，力求做到嬉笑怒骂皆成文章。 做一个真正的勇士，用平静的文字记录。即使生活在俗人的世界，也要用力生活，不愧于心，骂的文雅。","link":"/about/index.html"},{"title":"博客feature 计划（不一定修","text":"目录页 markdown高亮 友链 和aws页面，vuepress 连调 评论功能 打赏二维码 社交链接 改log 404页面 分类 搜索 草稿和发布的关系 标签 RSS订阅 归档 最近文章 FOLLOW.IT 订阅更新 文章折叠 图片的问题 固定左右边栏 头像 RSS订阅","link":"/todo/index.html"}]}